app/views/listings/index.html.erb

SELECT  "listings".* FROM "listings" ORDER BY "listings"."id" DESC LIMIT $1  [["LIMIT", 1]]
---

          <% Listing.bitfields[:amenities].each do |amenity, _| %>