app/views/bookings/_form.html.erb


  <% @listing.bookings.each do |booking| %>
---
SELECT "bookings".* FROM "bookings" WHERE "bookings"."listing_id" = $1  [["listing_id", 9]]