app/controllers/bookings_controller.rb

  def index
    @listing = Listing.find(params[:listing_id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def new
    @listing = Listing.find(params[:listing_id])
---
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def create
    @booking = current_user.bookings.new(booking_params)
    @booking.listing_id = params[:listing_id]
    # @listing = Listing.find(params[:listing_id])
    if @booking.save
      ReservationMailer.reservation_email(@booking.guest, @booking.host, @booking.id).deliver_now
      redirect_to '/listings/'+params[:listing_id]+'/bookings'+'/'+ @booking.id.to_s+'/new_payment'
       # new_payment_path(@listing.id, @booking.id)
    else
      @listing = Listing.find(params[:listing_id])
---
INSERT INTO "bookings" ("listing_id", "guest_id", "start_date", "end_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["listing_id", 1], ["guest_id", 8], ["start_date", "2019-01-01"], ["end_date", "2019-01-02"], ["created_at", "2018-02-20 05:22:58.994911"], ["updated_at", "2018-02-20 05:22:58.994911"]]
SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

 def pay
     @client_token = Braintree::ClientToken.generate
     @booking = Booking.find(params[:id])
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]

  def submit_payment
    # ??
    @booking = current_user.bookings.where([ "id = ?", params[:id] ]).first
---
SELECT  "bookings".* FROM "bookings" WHERE "bookings"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def destroy
    @booking = current_user.bookings.find(params[:id])
    if @booking.destroy
---
DELETE FROM "bookings" WHERE "bookings"."id" = $1  [["id", 8]]