app/controllers/listings_controller.rb

SELECT  "listings".* FROM "listings" ORDER BY "listings"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    @listings =Listing.all

INSERT INTO "listings" ("host_id", "title", "description", "location", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["host_id", 11], ["title", ""], ["description", ""], ["location", ""], ["created_at", "2018-03-01 06:19:22.146235"], ["updated_at", "2018-03-01 06:19:22.146235"]]
---
  def create
    @listing = current_user.listings.new(listing_params)
    if @listing.save!

UPDATE "listings" SET "description" = $1, "updated_at" = $2 WHERE "listings"."id" = $3  [["description", "Another test listing????"], ["updated_at", "2018-02-20 10:00:47.058267"], ["id", 8]]
---
  def update
    @listing = current_user.listings.find(params[:id])

    @listing.update(listing_params)

DELETE FROM "listings" WHERE "listings"."id" = $1  [["id", 1]]
---
  def destroy
    @listing = current_user.listings.find(params[:id])
    if @listing.destroy

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "listings".* FROM "listings"
---
  def show
    @listing = Listing.find(params[:id])
    @amenities = @listing.bitfield_values(:amenities).select{|key,value| value == true }