app/controllers/welcome_controller.rb

  def index
    @listings =Listing.all.limit(3)
---
SELECT  "listings".* FROM "listings" LIMIT $1  [["LIMIT", 3]]